МассивДнейНедели = Новый Массив;
МассивДнейНедели.Добавить("Понедельник");
МассивДнейНедели.Добавить("Вторник");
МассивДнейНедели.Добавить("Среда");
МассивДнейНедели.Добавить("Четверг");
МассивДнейНедели.Добавить("Пятница");
МассивДнейНедели.Добавить("Суббота");
МассивДнейНедели.Добавить("Воскресенье");

//Перем СчастливоеЧисло;
////Сообщить("Привет, Мир!");
////Сообщить("Привет, Мир!");
////Сообщить("Привет, Мир!")

//СчастливоеЧисло = 777;
//Сообщить(СчастливоеЧисло);
//СчастливоеЧисло = 888;
//Сообщить(СчастливоеЧисло);

//Если СчастливоеЧисло = 777 Тогда
//	
//	Сообщить("Всё правильно!");
//	
//ИначеЕсли СчастливоеЧисло = 888 Тогда
//	
//	Сообщить("Восьмерки тоже хорошо!");
//	
//Иначе
//	
//	Сообщить("Обшибка при установке значения!");
//	
//КонецЕсли;

//Для а = 0 по 10 Цикл
//	
//	Сообщить(а * а);
//	
//КонецЦикла

//ИскомоеЧисло = 1;        

//Пока (ИскомоеЧисло * ИскомоеЧисло) < 30000 Цикл
//	
//	ИскомоеЧисло = ИскомоеЧисло + 1;
//	
//КонецЦикла;

//Сообщить(ИскомоеЧисло - 1);


//ДвузначноеЧисло = 10;
//Степень = 5;
//Результат = 1;
//а = 0;
//Пока а < Степень Цикл
//	
//	Результат = Результат * ДвузначноеЧисло;
//	а = а + 1
//	
//КонецЦикла;
//Сообщить(Результат);
//Если Результат > 10000 Тогда
//	Сообщить("Результать больше 10000");
//Иначе
//	Сообщить("Результат меньше или равен 10000")
//КонецЕсли

Для Года = 0 По 9 Цикл
	
	   КонГод = КонецГода(ТекущаяДата() + Года * 365 * 24 * 60 * 60);
	   Результат = МассивДнейНедели[ДеньНедели(КонГод)- 1];
	   Сообщить(Результат);
	   
КонецЦикла
